name_user = input("Введите Ваше имя: ")
print(f"Добро пожаловать, {name_user}!")

temperature = float(input("Введите значение температуры реактора в градусах Цельсия: "))
pressure = float(input("Введите значение давления реактора в бар: "))  # добавить фичу с переводом ед. изм. давления

if 70 <= temperature <= 90:
    print(f"Температура реактора в норме, продолжайте работать, {name_user}.")
elif temperature > 90:
    print("Температура реактора превысила норму, охладите реактор!")
else:
    print("Температура реактора низка, повысьте температуру!")

if 2 <= pressure <= 5:
    print(f"Давление реактора в норме, продолжайте работать, {name_user}.")
elif pressure > 5:
    print("Давление реактора превысило норму, сбросьте давление!")
else:
    print("Давление реактора низко, необходимо повысить давление!")